/*
 *
 * Copyright 2015 gRPC authors.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

const data = [{
  "name": "1",
  "aria": "190",
  "bal": "61",
  "pH": "6",
  "gumus": "4,1",
  "azot": "17",
  "phosfor": "77",
  "kaliy": "73",
  "1": "20",
  "2": "0,44",
  "3": "0,59",
  "4": "0,31",
  "5": "0,01",
  "6": "0,192",
  "7": "0,02-0,056"
},
  {
    "name": "2",
    "aria": "170",
    "bal": "58",
    "pH": "6",
    "gumus": "3,8",
    "azot": "12",
    "phosfor": "87",
    "kaliy": "9,5",
    "1": "18",
    "2": "0,4",
    "3": "0,58",
    "4": "0,13",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "3",
    "aria": "117",
    "bal": "66",
    "pH": "6,7",
    "gumus": "3,8",
    "azot": "12",
    "phosfor": "75",
    "kaliy": "174",
    "1": "15",
    "2": "0,31",
    "3": "0,55",
    "4": "0,13",
    "5": "0,58",
    "6": "0,211",
    "7": "0,02-0,056"
  },
  {
    "name": "4",
    "aria": "127",
    "bal": "60",
    "pH": "6,6",
    "gumus": "4,1",
    "azot": "15",
    "phosfor": "50",
    "kaliy": "118",
    "1": "15",
    "2": "0,4",
    "3": "0,58",
    "4": "0,23",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "5",
    "aria": "25",
    "bal": "63",
    "pH": "6,2",
    "gumus": "3,8",
    "azot": "18",
    "phosfor": "67",
    "kaliy": "106",
    "1": "13",
    "2": "0,4",
    "3": "0,58",
    "4": "0,14",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "6",
    "aria": "100",
    "bal": "58",
    "pH": "5,8",
    "gumus": "4,3",
    "azot": "20",
    "phosfor": "44",
    "kaliy": "72",
    "1": "16",
    "2": "0,4",
    "3": "0,58",
    "4": "0,2",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "7а",
    "aria": "107",
    "bal": "58",
    "pH": "6,5",
    "gumus": "4,3",
    "azot": "12",
    "phosfor": "75",
    "kaliy": "71",
    "1": "40",
    "2": "0,4",
    "3": "0,58",
    "4": "0,24",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "7б",
    "aria": "27",
    "bal": "66",
    "pH": "6,4",
    "gumus": "4,2",
    "azot": "16",
    "phosfor": "95",
    "kaliy": "95",
    "1": "17",
    "2": "0,4",
    "3": "0,58",
    "4": "0,24",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "8",
    "aria": "113",
    "bal": "66",
    "pH": "6,4",
    "gumus": "4,2",
    "azot": "16",
    "phosfor": "95",
    "kaliy": "95",
    "1": "17",
    "2": "0,4",
    "3": "0,58",
    "4": "0,24",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "9",
    "aria": "140",
    "bal": "68",
    "pH": "6,8",
    "gumus": "4,4",
    "azot": "19",
    "phosfor": "81",
    "kaliy": "109",
    "1": "30",
    "2": "0,4",
    "3": "0,58",
    "4": "0,4",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "10",
    "aria": "142",
    "bal": "70",
    "pH": "5,8",
    "gumus": "3,9",
    "azot": "21",
    "phosfor": "81",
    "kaliy": "138",
    "1": "19",
    "2": "0,4",
    "3": "0,58",
    "4": "0,21",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "11",
    "aria": "45",
    "bal": "76",
    "pH": "6,2",
    "gumus": "3,8",
    "azot": "15",
    "phosfor": "172",
    "kaliy": "153",
    "1": "10",
    "2": "0,4",
    "3": "0,58",
    "4": "0,18",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "12",
    "aria": "87",
    "bal": "55",
    "pH": "6,4",
    "gumus": "3,4",
    "azot": "12",
    "phosfor": "45",
    "kaliy": "116",
    "1": "10",
    "2": "0,4",
    "3": "0,58",
    "4": "0,16",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "13",
    "aria": "34",
    "bal": "55",
    "pH": "6,4",
    "gumus": "3,4",
    "azot": "12",
    "phosfor": "45",
    "kaliy": "116",
    "1": "10",
    "2": "0,4",
    "3": "0,58",
    "4": "0,16",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "14",
    "aria": "109",
    "bal": "52",
    "pH": "6,2",
    "gumus": "3,2",
    "azot": "19",
    "phosfor": "40",
    "kaliy": "57",
    "1": "15",
    "2": "0,4",
    "3": "0,58",
    "4": "0,14",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "15",
    "aria": "38",
    "bal": "63",
    "pH": "7",
    "gumus": "4,5",
    "azot": "16",
    "phosfor": "56",
    "kaliy": "117",
    "1": "14",
    "2": "0,4",
    "3": "0,58",
    "4": "0,22",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "16",
    "aria": "48",
    "bal": "63",
    "pH": "7",
    "gumus": "4,5",
    "azot": "16",
    "phosfor": "56",
    "kaliy": "117",
    "1": "14",
    "2": "0,4",
    "3": "0,58",
    "4": "0,22",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "17",
    "aria": "10",
    "bal": "61",
    "pH": "7,2",
    "gumus": "3,3",
    "azot": "11",
    "phosfor": "98",
    "kaliy": "119",
    "1": "14",
    "2": "0,4",
    "3": "0,58",
    "4": "0,17",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "18",
    "aria": "28",
    "bal": "61",
    "pH": "7,2",
    "gumus": "3,3",
    "azot": "11",
    "phosfor": "98",
    "kaliy": "119",
    "1": "14",
    "2": "0,4",
    "3": "0,58",
    "4": "0,17",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "19",
    "aria": "140",
    "bal": "61",
    "pH": "7,2",
    "gumus": "3,3",
    "azot": "11",
    "phosfor": "98",
    "kaliy": "119",
    "1": "14",
    "2": "0,4",
    "3": "0,58",
    "4": "0,17",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "20",
    "aria": "110",
    "bal": "71",
    "pH": "6",
    "gumus": "3,4",
    "azot": "25",
    "phosfor": "87",
    "kaliy": "138",
    "1": "21",
    "2": "0,4",
    "3": "0,58",
    "4": "0,2",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "21",
    "aria": "64",
    "bal": "66",
    "pH": "6,4",
    "gumus": "4,2",
    "azot": "16",
    "phosfor": "95",
    "kaliy": "95",
    "1": "17",
    "2": "0,4",
    "3": "0,58",
    "4": "0,24",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "22",
    "aria": "100",
    "bal": "68",
    "pH": "6,8",
    "gumus": "4,4",
    "azot": "19",
    "phosfor": "81",
    "kaliy": "109",
    "1": "30",
    "2": "0,4",
    "3": "0,58",
    "4": "0,4",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "23а",
    "aria": "122",
    "bal": "66",
    "pH": "6",
    "gumus": "3,9",
    "azot": "18",
    "phosfor": "84",
    "kaliy": "111",
    "1": "16",
    "2": "0,31",
    "3": "0,57",
    "4": "0,19",
    "5": "1,18",
    "6": "0,08",
    "7": "0,02-0,056"
  },
  {
    "name": "23б",
    "aria": "47",
    "bal": "66",
    "pH": "6",
    "gumus": "3,9",
    "azot": "18",
    "phosfor": "84",
    "kaliy": "111",
    "1": "16",
    "2": "0,31",
    "3": "0,57",
    "4": "0,19",
    "5": "1,18",
    "6": "0,08",
    "7": "0,02-0,056"
  },
  {
    "name": "24",
    "aria": "65",
    "bal": "76",
    "pH": "6,2",
    "gumus": "3,8",
    "azot": "15",
    "phosfor": "172",
    "kaliy": "153",
    "1": "10",
    "2": "0,4",
    "3": "0,58",
    "4": "0,18",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "25",
    "aria": "115",
    "bal": "55",
    "pH": "6,3",
    "gumus": "3,3",
    "azot": "12",
    "phosfor": "38",
    "kaliy": "117",
    "1": "14",
    "2": "0,4",
    "3": "0,58",
    "4": "0,2",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  },
  {
    "name": "26",
    "aria": "60",
    "bal": "59",
    "pH": "6,2",
    "gumus": "4",
    "azot": "14",
    "phosfor": "60",
    "kaliy": "104",
    "1": "14",
    "2": "0,4",
    "3": "0,58",
    "4": "0,23",
    "5": "0,59",
    "6": "0,145",
    "7": "0,02-0,056"
  }]
let general = [
  {
    "Клас": "1",
    "Ступінь забезпеченості грунтів": "Дуже низький",
    "Фосфор, мг/кг": "0-20",
    "Калій, мг/кг": "0-20",
    "Азот, мг/кг": "0-20",
    "Гумус,%": ""
  },
  {
    "Клас": "2",
    "Ступінь забезпеченості грунтів": "Низький",
    "Фосфор, мг/кг": "21-50",
    "Калій, мг/кг": "21-40",
    "Азот, мг/кг": "0-10",
    "Гумус,%": "2,1-3,0"
  },
  {
    "Клас": "3",
    "Ступінь забезпеченості грунтів": "Середній",
    "Фосфор, мг/кг": "51-100",
    "Калій, мг/кг": "41-80",
    "Азот, мг/кг": "11-30",
    "Гумус,%": "3,1-4,0"
  },
  {
    "Клас": "4",
    "Ступінь забезпеченості грунтів": "Підвищений",
    "Фосфор, мг/кг": "101-150",
    "Калій, мг/кг": "81-120",
    "Азот, мг/кг": "більше 30",
    "Гумус,%": "4,1-5,0"
  },
  {
    "Клас": "5",
    "Ступінь забезпеченості грунтів": "Високий",
    "Фосфор, мг/кг": "151-200",
    "Калій, мг/кг": "121-180",
    "Азот, мг/кг": "",
    "Гумус,%": "5,1-6,0"
  },
  {
    "Клас": "6",
    "Ступінь забезпеченості грунтів": "Дуже високий",
    "Фосфор, мг/кг": "більше 200",
    "Калій, мг/кг": "більше 180",
    "Азот, мг/кг": "",
    "Гумус,%": "більше 6,0"
  },
  {
    "Клас": "1",
    "Ступінь забезпеченості грунтів": "Дуже низький",
    "Фосфор, мг/кг": "га",
    "Калій, мг/кг": "%",
    "Азот, мг/кг": "га",
    "Гумус,%": "%"
  },
  {
    "Клас": "2",
    "Ступінь забезпеченості грунтів": "Низький",
    "Фосфор, мг/кг": "645",
    "Калій, мг/кг": "11,9",
    "Азот, мг/кг": "170",
    "Гумус,%": "3,1",
    "Unnamed: 7": "0"
  },
  {
    "Клас": "3",
    "Ступінь забезпеченості грунтів": "Середній",
    "Фосфор, мг/кг": "4276,4",
    "Калій, мг/кг": "78,6",
    "Азот, мг/кг": "621",
    "Гумус,%": "11,4",
    "Unnamed: 7": "5428,4",
    "Unnamed: 8": "99,7",
    "Unnamed: 9": "3392",
    "Unnamed: 10": "62,3"
  },
  {
    "Клас": "4",
    "Ступінь забезпеченості грунтів": "Підвищений",
    "Фосфор, мг/кг": "169",
    "Калій, мг/кг": "3,1",
    "Азот, мг/кг": "2718",
    "Гумус,%": "49,9",
    "Unnamed: 7": "0",
    "Unnamed: 8": "0",
    "Unnamed: 9": "2050,4",
    "Unnamed: 10": "37,7"
  },
  {
    "Клас": "5",
    "Ступінь забезпеченості грунтів": "Високий",
    "Фосфор, мг/кг": "338",
    "Калій, мг/кг": "6,2",
    "Азот, мг/кг": "1933,4",
    "Гумус,%": "35,5",
    "Unnamed: 7": "0",
    "Unnamed: 8": "0",
    "Unnamed: 9": "0",
    "Unnamed: 10": "0"
  },
  {
    "Клас": "6",
    "Ступінь забезпеченості грунтів": "Дуже високий",
    "Фосфор, мг/кг": "14",
    "Калій, мг/кг": "0,3",
    "Азот, мг/кг": "0",
    "Гумус,%": "0",
    "Unnamed: 7": "0",
    "Unnamed: 8": "0",
    "Unnamed: 9": "0",
    "Unnamed: 10": "0"
  },
  {
    "Клас": "Всього",
    "Ступінь забезпеченості грунтів": "",
    "Фосфор, мг/кг": "5442,4",
    "Калій, мг/кг": "100",
    "Азот, мг/кг": "5442,4",
    "Гумус,%": "100",
    "Unnamed: 7": "5442,4",
    "Unnamed: 8": "100",
    "Unnamed: 9": "5442,4",
    "Unnamed: 10": "100"
  }
]


var PROTO_PATH = __dirname + '/../../protos/helloworld.proto';

var parseArgs = require('minimist');
var grpc = require('@grpc/grpc-js');
var readline = require("readline");
var protoLoader = require('@grpc/proto-loader');
var packageDefinition = protoLoader.loadSync(
  PROTO_PATH,
  {
    keepCase: true,
    longs: String,
    enums: String,
    defaults: true,
    oneofs: true
  });
var hello_proto = grpc.loadPackageDefinition(packageDefinition).helloworld;

function main() {

  var client = new hello_proto.Greeter('localhost:50051',
    grpc.credentials.createInsecure());

  const rl = readline.createInterface({
    input: process.stdin,
    output: process.stdout,
  });


  client.sayHelloAgain({name: 'you'}, function (err, response) {
    rl.question(" 1. Загальна інформація\n 2. Групування грунтів за вмістом в них рухомого фосфору, калію,азоту і гумусу  \nВибір:  ", function (answer) {
      rl.question("Введіть індекс ", function (index) {

        if (parseInt(answer) === 1) {
          console.log(data[index]);

          rl.close();
        } else {
          console.log(general[index]);
          rl.close();
        }
      });
    });
  });
}

main();
